Repository: hogdevelopment/bat_combined
Catalog: BespokeLocationV2/*.lproj/Localizable.strings
Languages: ro

source: Settings
ro: Setări

source: Rate the app
ro: Evaluați această aplicație

source: Share the app
ro: Distribuiți aplicația

source: Privacy
ro: Privat

source: Distance
ro: Distanță

source: Clear filter
ro: Sterge filtru

source: Save filter
ro: Salvează filtru

source: Clear filters
ro: Sterge filtre

source: Hotel Bars
ro: Baruri in hotel

source: Bars
ro: Baruri

source: Pubs
ro: Pub-uri

source: Cafes
ro: Cafenele

source: Restaurants
ro: Restaurante

source: Lounges
ro: Lounge-uri

source: Clubs
ro: Cluburi

source: Search
ro: Caută

source: Users filters
ro: Filtrele utilizatorului

source: Cancel
ro: Anulează

source: Feedback for smoking app
ro: Feedback ptr aplicație

source: Help/Improve smoking app
ro: Sugestii/Imbunătățiri

source: Sign up
ro: Inregistrare

source: Get started
ro: Start

source: subtitle text
ro: subtitlu

source: Username
ro: Nume utilizator

source: Date of birth
ro: Data de nastere

source: Gender
ro: Gen

source: Password
ro: Parola

source: or sign up with
ro: sau inregistreaza-te cu

source: MM.DD.YYYY
ro: LL.ZZ.AAAA

source: Male
ro: Masculin

source: Female
ro: Feminin

source: Error
ro: Eroare

source: Not needed
ro: Nu e nevoie

source: Where to Smoke
ro: Unde sa fumezi

source: or Login with
ro: sau inregistreaza-te cu

source: Forgot Password?
ro: Ai uitat parola?

source: Done
ro: Gata

source: Register
ro: Inregistreaza-te

source: Kilometers
ro: Kilometri

source: Miles
ro: Mile

source: There is no user registered with this email.
ro: Nu exista user inregistrat cu aceasta adresa de email.

source: An email was sent to this address.
ro: Un email a fost trimis la aceasta adresa.

source: Email or password incorrect.
ro: Email sau parola incorecta.

source: I am 18 years old
ro: Am peste 18 ani

source: All fields should be entered
ro: Toate campurile trebuie completate

source: Please enter a valid email address
ro: Te rog adauga o adresa de email valida

source: We are unable to access some of your details. Please fill in the rest of the fields.
ro: Nu am reusit sa accesam toate informatiile. Te rugam sa completezi campurile ramase.

source: There is no user registered with this informations.
ro: Acest user nu este inregistrat.

source: Details
ro: Detalii

source: This venue has been added to your favourites
ro: Ai adaugat deja aceasta locatie la favorite.

source: Dismiss
ro: Anuleaza

source: Currently no photos available
ro: Nu exista poze.

source: Upload photo
ro: Urca poza

source: Get there
ro: Arata ruta

source: Call
ro: Suna

source: Previous
ro: Precedentul

source: Next
ro: Următorul

source: Edit Filters
ro: Editează Filtrele

source: About
ro: Despre

source: Feedback
ro: Hrănește-mă înapoi

source: Favourites
ro: Preferate

source: FAQs
ro: ÎPD-urile

source: Privacy Policy
ro: Politica din Securitate

source: Profile
ro: Profil
